// 함수형 컴포넌트를 배워서 사용했었고
// 컴포넌트는 종료가 함수형, 클래스형도 있다.
// class 컴포넌트는 이제 거의 사용하진 않지만
// 읽고 넘어가자, 함수형 컴포넌트로 넘어가는 추세 좀 됐다.
// class 컴포넌트를 알고 가야하는 이유 (이 아이는 코드가 좀 길고 복잡하다)
// 이미 전부터 작업을 해놓은 회사들은 class 컴포넌트로 작업한 곳이 있을 수 있다.
// 그래서 해석은 해야하고 뭔지는 알아야 하기 때문에
// 자료들 찾아보면 공식 문서에도 class 컴포넌트로 작성되어 있는 것들이  있기 때문에
// 그리고 과거에는 lifecycle 이 class 컴포넌트에서만 동작했었다(과거)
// 2019년도 쯤 함수형 컴포넌트도 lifecycle 함수가 제공되기 시작했다.
// 그래서 사람들이 더 간단하고 편리한 함수형 컴포넌트로 넘어가는 추세
// 실제로 지금 공식 문서에서도 함수형 컴포넌트를 쓰라고 추천하고 있다.
// 그래도 해석은 할 줄 알아야 하니까 class 컴포넌트를 짚고 넘어가자.
